"use client";
import PathPage from "@/app/components/PathPage";
import SidebarCatalogMenu from "@/app/components/Sidebar/SidebarCatalogMenu";
import SidebarStickyHelp from "@/app/components/Sidebar/SidebarStickyHelp";
import Promo from "@/app/components/Promo";
import Link from "next/link";

const GraveyardLandscapingPage = () => {

    return (
        <>
            <section className="page-centered mt-5 max-w-[1300px] flex">
                <div className="max-w-[25%] w-full hidden lg:block space-y-7.5 ml-5">
                    <SidebarCatalogMenu />
                    <SidebarStickyHelp />
                </div>
                <div className="w-[100%] lg:ml-5 lg:max-w-[75%]">

                    <div className="pl-5 lg:pl-0">
                        <PathPage />
                        <h1 className="text-black text-[28px] mt-2.5 leading-8 lg:text-[40px] lg:leading-12 font-[600]">Благоустройство могил</h1>
                    </div>

                    {/* Основной контент */}
                    <div className="mt-7.5 font-[600] shadow-xs p-5 lg:p-7.5 rounded-lg">
                        {/* Введение */}
                        <p className="text-[#2c3a54] mb-5">
                            Благоустройство могил важнейший этап работы на кладбище. От качества проведённых работ по благоустройству места захоронения зависит сохранность всех установленных элементов (памятников, оград, ваз).
                        </p>

                        {/* Пример благоустройства */}
                        <div className="mb-5">
                            <img src="/landscape/graves/1.webp" alt="Пример благоустройства могилы" className="w-full h-auto rounded-lg" />
                        </div>

                        {/* Влияние природных факторов */}
                        <p className="text-[#2c3a54] mb-5">
                            Постоянные перепады температур, прорастающая трава, глинистая почва на кладбищах (Западное, Колодищи и другие), естественная усадка земли и другие природные факторы нарушают целостность надгробного памятника и гранитной ограды. Оформление могил защищает захоронение и увеличивает срок службы установленных элементов мемориального комплекса.
                        </p>

                        {/* Перечень работ */}
                        <h2 className="lg:text-[24px] font-bold text-[#2c3a54] mb-3.75">Перечень работ по благоустройству могилы</h2>
                        <p className="text-[#2c3a54] mb-5">
                            Благоустройство места захоронения нужно выполнять до или во время установки памятника на кладбище (зависит от типа благоустройства). Виды работ по обустройству могилы от компании «Каменная роза»:
                        </p>
                        <ul className="list-disc pl-10 text-[#2c3a54] space-y-1 mb-5">
                            <li>доставка материалов до кладбища;</li>
                            <li>планировка участка (на участках с уклоном нивелируется перепад высоты);</li>
                            <li>обсыпка захоронения декоративным щебнем или укладка искусственного газона;</li>
                            <li>установка тротуарного борта по периметру участка;</li>
                            <li>заливка ленточного фундамента и установка бессер-блоков по периметру участка;</li>
                            <li>заливка монолитного фундамента на участок;</li>
                            <li>заливка армированной стяжки на место установки памятника и гранитной ограды;</li>
                            <li>укладка керамогранитной или грес-плитки на стяжку;</li>
                            <li>установка надгробия и других элементов комплекса на фундамент;</li>
                            <li>демонтаж существующих изделий и расчистка участка для дальнейшего проведения работ.</li>
                        </ul>
                        <p className="text-[#2c3a54] mb-5">
                            Важно понимать, что оформление могил на кладбище включает сразу несколько вариантов из указанного выше перечня работ и зависит от пожеланий конкретного заказчика, размеров участка, типа почвы и других особенностей участка.
                        </p>

                        <div className="mb-5">
                            <img src="/landscape/graves/2.webp" alt="Заливка ленточного фундамента и укладка бессер-блоков" className="w-full h-auto rounded-lg" />
                        </div>

                        {/* Благоустройство в Минске */}
                        <p className="text-[#2c3a54] mb-5">
                            Благоустройство могил в Минске отличается от работ на деревенских кладбищах, так как некоторые из минских кладбищ имеют глинистую почву и требуют заливку усиленного ленточного фундамента и установку свай. Кроме того, большинство кладбищ имеют регламентированные размеры под одиночные, двойные и тройные захоронения. Заливка фундамента в таком случае возможно только в пределах размера, указанного в справке о захоронении.
                        </p>

                        {/* Виды работ */}
                        <h2 className="lg:text-[24px] font-bold text-[#2c3a54] mb-3.75">Благоустройство мест захоронений: виды и их особенности</h2>
                        <p className="text-[#2c3a54] mb-5">
                            Выделяют несколько основных видов работ по обустройству могилы на кладбище. Они зависят от пожеланий заказчика по внешнему виду, особенностей почвы и бюджета. Остановимся подробнее на каждом.
                        </p>

                        {/* Установка на балки */}
                        <h3 className="lg:text-[20px] font-bold text-[#2c3a54] mb-2.5">Установка памятника на балки с или без подсыпки щебня или укладки искусственного газона</h3>
                        <p className="text-[#2c3a54] mb-5">
                            Установка надгробия на балки — один из бюджетных и простых в исполнении вариантов благоустройства могилы. В данном случае под памятник продольно укладывают две железобетонные балки. Данный способ хорошо работает, когда на участке нет больших перепадов рельефа (участок должен быть ровным), а с момента захоронения должно пройти не менее года.
                        </p>
                        <div className="mb-5">
                            <img src="/landscape/graves/3.webp" alt="Установка памятника на балки" className="w-full h-auto rounded-lg" />
                        </div>
                        <p className="text-[#2c3a54] mb-5">
                            Важно, что данный способ установки рекомендуется для изделий стандартного размера. Под памятники толщиной 8 и более см и высотой более 120 рекомендуем заливать фундамент.
                        </p>

                        {/* Заливка ленточного фундамента */}
                        <h3 className="lg:text-[20px] font-bold text-[#2c3a54] mb-2.5">Заливка ленточного фундамента и укладка бессер-блоков</h3>
                        <p className="text-[#2c3a54] mb-5">
                            Самый популярный и простой в уходе вариант благоустройства — заливка ленточного фундамента и монтаж на него бессер-блоков. Преимущества данного способа установки:
                        </p>
                        <ul className="list-disc pl-10 text-[#2c3a54] space-y-1 mb-5">
                            <li>устойчивость к движению почвы;</li>
                            <li>долговечность;</li>
                            <li>простота в уходе.</li>
                        </ul>
                        <div className="mb-5">
                            <img src="/landscape/graves/4.webp" alt="Заливка ленточного фундамента и укладка бессер-блоков" className="w-full h-auto rounded-lg" />
                        </div>
                        <p className="text-[#2c3a54] mb-5">
                            Этапы работ при заливке фундамента из бессер-блоков:
                        </p>
                        <ul className="list-disc pl-10 text-[#2c3a54] space-y-1 mb-5">
                            <li>подготовка опалубки и армирование для заливки ленточного фундамента;</li>
                            <li>заливка ленточного фундамента 15x15 см по периметру участка;</li>
                            <li>монтаж бессер-блоков на фундамент;</li>
                            <li>заливка армированной стяжки на место монтажа памятника;</li>
                            <li>заливка неармированной стяжки на свободное место;</li>
                            <li>укладка плитки на стяжку (не ранее, чем через две недели после заливки стяжки);</li>
                            <li>установка надгробия и других элементов на плитку;</li>
                            <li>монтаж ваз, лампад и других аксессуаров.</li>
                        </ul>

                        {/* Заливка монолитного фундамента */}
                        <h3 className="lg:text-[20px] font-bold text-[#2c3a54] mb-2.5">Заливка монолитного фундамента</h3>
                        <p className="text-[#2c3a54] mb-5">
                            Монолитный фундамент обеспечивает максимальную целостность конструкции и долговечность участка на кладбище. При работе с монолитом опалубка для фундамента выставляется сразу на желаемую высоту (обычно 20 и более сантиметров над уровнем земли и 15-20 см в глубину). В варианте с монолитным фундаментом торцы также обкладывают плиткой.
                        </p>
                        <div className="mb-5">
                            <img src="/landscape/graves/5.webp" alt="Заливка монолитного фундамента" className="w-full h-auto rounded-lg" />
                        </div>

                        {/* Цены на благоустройство */}
                        <h2 className="lg:text-[24px] font-bold text-[#2c3a54] mb-3.75">Цены на благоустройство могилы на кладбище</h2>
                        <p className="text-[#2c3a54] mb-5">
                            Стоимость работ на благоустройство мест захоронений зависит от нескольких факторов:
                        </p>
                        <ul className="list-disc pl-10 text-[#2c3a54] space-y-1 mb-5">
                            <li>размер участка;</li>
                            <li>рельеф местности (наличие уклона);</li>
                            <li>выбранный способ установки (на балки, на бессер-фундамент, на монолитный фундамент);</li>
                            <li>высота фундамента;</li>
                            <li>выбранный тип плитки (керамогранит, гранитная, тротуарная, грес, брусчатка).</li>
                        </ul>
                        <p className="text-[#2c3a54] mb-5">
                            Все вид работ можно комбинировать друг с другом. Например, можно залить монолитный фундамент и облицевать его гранитной плиткой сверху и плиткой грес на торцах. Или можно залить бессер-фундамент и положить плитку только по контуру блоков.
                        </p>
                        <p className="text-[#2c3a54] mb-5">
                            Окончательная стоимость работ оговаривается непосредственно в офисе на консультации с менеджером или на кладбище при выполнении замера участка.
                        </p>

                        {/* Почему стоит заказать */}
                        <h2 className="lg:text-[24px] font-bold text-[#2c3a54] mb-3.75">Почему стоит заказать благоустройство в «Каменная роза»</h2>
                        <p className="text-[#2c3a54] mb-5">
                            Установщики «Каменная роза» имеют опыт работы на всех городских и деревенских кладбищах Минска и Минской области. В работе используем проверенные годы материалы.
                        </p>
                        <p className="text-[#2c3a54] mb-5">
                            Преимущества заказа установки в «Каменная роза»:
                        </p>
                        <ul className="list-disc pl-10 text-[#2c3a54] space-y-1 mb-5">
                            <li>при заливке монолитных фундаментов используем раствор из ближайших бетонных узлов с доставкой прямо к месту установки;</li>
                            <li>закупаем бессер-блоки у прямого производителя;</li>
                            <li>перебрали десятки вариантов керамогранитной плитки и выбрали самые надежные варианты;</li>
                            <li>при укладке плитки используем высокозластичный клей Ceresit CM-16;</li>
                            <li>при монтаже каменных элементов надгробия и ограды работаем с проверенными производителями полиуретановых герметиков.</li>
                        </ul>

                        {/* Как заказать */}
                        <h2 className="lg:text-[24px] font-bold text-[#2c3a54] mb-3.75">Как заказать благоустройство могилы</h2>
                        <p className="text-[#2c3a54] mb-5">
                            Для заказа благоустройства в Минске и области нужно подготовить следующую информацию:
                        </p>
                        <ul className="list-disc pl-10 text-[#2c3a54] space-y-1 mb-5">
                            <li>адрес кладбища;</li>
                            <li>место, сектор и ряд захоронения;</li>
                            <li>взять с собой памятку о захоронении с указанием выделенного размера;</li>
                            <li>выбрать тип фундамента;</li>
                            <li>выбрать плитку.</li>
                        </ul>
                        <p className="text-[#2c3a54] mb-5">
                            Для удобства работы можно предварительно сделать фото захоронения. Несколько фотографий могилы с разных ракурсов обычно позволяют опытному менеджеру точно определить наличие уклона и другие нюансы.
                        </p>
                        <p className="text-[#2c3a54] mb-5">
                            В большинстве случаев указанной информации хватает для того, чтобы сделать заказ. Для получения максимально подробной консультации и решения спорных моментов на кладбище выезжает замерщик.
                        </p>
                        <p className="text-[#2c3a54] mb-5">
                            Выезд замерщика на кладбище нужен, если:
                        </p>
                        <ul className="list-disc pl-10 text-[#2c3a54] space-y-1 mb-5">
                            <li>на участке большой уклон;</li>
                            <li>сомневаетесь в размере;</li>
                            <li>нужно оценить сложность демонтажа старых конструкций;</li>
                            <li>нужно оценить вероятность сохранения старых элементов для переустановки;</li>
                            <li>нужно оценить возможность реставрации старого памятника.</li>
                        </ul>
                        <p className="text-[#2c3a54] mb-5">
                            Для каждого из видов благоустройства в офисе предусмотрены образцы. Например, в офисе представлены шесть вариантов бессер-блоков разной расцветки и типа поверхности (рельефный и полированный).
                        </p>
                        <p className="text-[#2c3a54] mb-5">
                            В офисе также представлены образцы керамогранитной плитки, плитки Грес, 30 вариантов гранита для памятника, гранитной плитки, различные варианты декоративного щебня и искусственный газон.
                        </p>
                        <p className="text-[#2c3a54] mb-5">
                            Также в офисе представлен полноценный участок на стандартное двойное захоронение размером 2x2.3м.
                        </p>
                        <p className="text-[#2c3a54]">
                            <strong>Для консультации по благоустройству могилы звоните по телефонам, указанным в шапке сайта или приходите в офис. Будем рады вам помочь.</strong>
                        </p>
                    </div>
                </div>
            </section>

            {/* внизу страницы */}
            <div className="mb-12.5 lg:mb-15">
                <Promo />
            </div>
        </>
    );
};

export default GraveyardLandscapingPage;