export const campaigns = [
    {
      id: 1,
      title: "Гранитная ваза в подарок!",
      description: "При заказе памятника и благоустройства гранитная ваза из двух половин - в подарок",
      image: "/promo/1.webp",
      link: "/",
    },
    {
      id: 2,
      title: "Ваза из полимербетона в подарок!",
      description: "При заказе памятника и благоустройства ваза из полимербетона на кладбище в подарок",
      image: "/promo/2.webp",
      link: "/",
    },
    {
      id: 3,
      title: "Благоустройство могил на весну-лето 2025 года",
      description: "Выгода при оформлении договора на установку на весну-лето 2025 года!",
      image: "/promo/3.webp",
      link: "/",
    },
  ];